<?php
/* ملف لربط قاعد البيانات بالموقع، حيث يتم إنشاء متغير يحتوي تفاصيل قاعدة البيانات */
/* المتغير الأول يحتوي اسم الهوست والثاني يحتوي اسم 
المستخدم الخاص بقاعدة البيانات والثلاث كلمة 
المرور والرابع اسم قاعدة البيانات الخاصة بالموقع
 والتي يجب أن تكون مضافة على بي اتش بي ماي ادمين */
$con = mysqli_connect("localhost","root","","dailyexpense");
/* يستخدم المثيود أعلاه للاتصال في قاعدة البيانات لتسهيل جلب
 وارسال البيانات لتخزينها في قاعدة البيانات  */
 /* يتم وضع الشرط التالي لفحص هل ظهر مشكلة في عملية الاتصال أم لا  */
 /*  اذا طهرت مشكلة يتحقق الشرط فيطبع المشكلة ورسالة تفيد حدوث المشكلة*/
if (mysqli_connect_errno())
  {
  echo "Failed to connect to MySQL: " . mysqli_connect_error() ." | Seems like you haven't created the DATABASE with an exact name";
  }
?>